Repository: victorlevasseur/GD-Widgets-Extension
Catalog: Translations/*/TextBoxObject.po
Languages: fr_fr

source: Widgets - TextBox object
fr_fr: Widgets - Objet zone de texte

source: Part of the Widgets extension. Provides an object to allow the user to enter and edit a line of text.
fr_fr: Fait partie de l'extension Widgets. Fournit un objet permettant à l'utilisateur d'entrer et d'éditer une ligne de texte.

source: Text Box
fr_fr: Zone de texte

source: Allows the user to edit a text
fr_fr: Permet à l'utilisateur d'éditer un texte

source: Modify the text
fr_fr: Modifier le texte

source: Modify the text of a Text Box object.
fr_fr: Modifie le texte d'un objet zone de texte.

source: Do _PARAM1__PARAM2_ to the text of _PARAM0_
fr_fr: Faire _PARAM1__PARAM2_ au texte de _PARAM0_

source: Text
fr_fr: Texte

source: Object
fr_fr: Objet

source: Modification's sign
fr_fr: Signe de modification

source: Test the text
fr_fr: Tester le texte

source: Test the text of a Text Box object.
fr_fr: Teste le texte d'un objet zone de texte.

source: The text of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: Le texte de _PARAM0_ est _PARAM1__PARAM2_

source: Sign of the test
fr_fr: Signe du test

source: Text to test
fr_fr: Texte à tester

source: Modify the hide character
fr_fr: Modifier le caractère de masquage

source: Modify the hide character (character hiding the text) of a Text Box object. Put an empty hide character to disable it.
fr_fr: Modifie le caractère masquant (caractère qui cache le contenu) d'un objet zone de texte. Mettre un caractère vide pour désactiver cette fonction.

source: Set _PARAM1_ as the hide character of _PARAM0_
fr_fr: Mettre _PARAM1_ en caractère masquant de _PARAM0_

source: Hide character
fr_fr: Caractère masquant

source: Test the hide character
fr_fr: Tester le caractère masquant

source: Test the hide character (character hiding the text) of a Text Box object.
fr_fr: Teste le caractère masquant (caractère qui masque le contenu) d'un objet zone de texte.

source: The hide character of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: Le caractère masquant de _PARAM0_ est _PARAM1__PARAM2_

source: Hide character to test
fr_fr: Caractère à tester

source: Hide character (character hiding the string in the Text Box)
fr_fr: Caractère masquant (caractère masquant le contenu d'une zone de texte)

source: Modify the placeholder
fr_fr: Modifier le texte d'indication

source: Modify the placeholder (text shown when there is no text) of a Text Box object.
fr_fr: Modifie le texte d'indication (texte affiché quand la zone de texte est vide) d'un objet zone de texte.

source: Do _PARAM1__PARAM2_ to the placeholder of _PARAM0_
fr_fr: Faire _PARAM1__PARAM2_ au texte d'indication de _PARAM0_

source: Placeholder
fr_fr: Texte d'indication

source: Test the placeholder
fr_fr: Tester le texte d'indication

source: Test the placeholder (text shown when there is no text) of a Text Box object.
fr_fr: Teste le texte d'indication (texte affiché quand la zone de texte est vide) d'un objet zone de texte.

source: The placeholder of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: Le texte d'indication de _PARAM0_ is _PARAM1__PARAM2_

source: Placeholder to test
fr_fr: Texte d'indication à tester

source: Placeholder (text shown when the Text Box is empty)
fr_fr: Texte d'indication (texte affiché quand la zone de texte est vide)

source: Enable or disable the text selection
fr_fr: (Dés)activer la sélection de texte

source: Enable or disable the text selection. If disabled, you can move the cursor but can't select a text by dragging.
fr_fr: (Dés)active la selection de texte. Si elle est désactivée, vous pouvez déplacer le curseur mais pas sélectionner une texte en glissant la souris.

source: Enable the text selection of _PARAM0_ ? _PARAM1_
fr_fr: Activer la sélection de texte de _PARAM0_ ? _PARAM1_

source: Selection/Cursor
fr_fr: Sélection/Curseur

source: Enable ?
fr_fr: Activer ?

source: Test if the text selection is enabled
fr_fr: Tester si la sélection de texte est activée

source: The text selection of _PARAM0_ is enabled
fr_fr: La sélection de texte de _PARAM0_ is activée

source: Test the selected text
fr_fr: Tester le texte sélectionné

source: Test the selected text of a Text Box object.
fr_fr: Teste le texte sélectionné d'un objet zone de texte.

source: The selected text of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: Le texte sélectionné de _PARAM0_ est _PARAM1__PARAM2_

source: Selected text
fr_fr: Texte sélectionné

source: Move the cursor
fr_fr: Déplacer le curseur

source: Move the cursor at a specific position.
fr_fr: Déplace le curseur à une position précise.

source: Move the cursor of _PARAM0_ to _PARAM1_
fr_fr: Déplacer le curseur de _PARAM0_ à _PARAM1_

source: Change the selection position
fr_fr: Changer la position de la sélection

source: Change the selection position (beginning and ending).
fr_fr: Change la position de la sélection (début et fin)

source: Set the selection of _PARAM0_ from _PARAM1_ to _PARAM2_
fr_fr: Mettre la sélection de _PARAM0_ à partir de _PARAM1_ jusqu'à _PARAM2_

source: Begin position
fr_fr: Position de début

source: End position
fr_fr: Position de fin

source: Selection begin
fr_fr: Début de la sélection

source: Selected begin position
fr_fr: Position du début de la sélection

source: Selection end
fr_fr: Fin de la sélection

source: Selected end position
fr_fr: Position de fin de la sélection

source: Modify the text font
fr_fr: Modifier la police du texte

source: Modify the text font of a Text Box object.
fr_fr: Modifie la police du texte de l'objet zone de texte.

source: Change text font of _PARAM0_ to _PARAM1_
fr_fr: Changer la police de _PARAM0_ en _PARAM1_

source: Font
fr_fr: Police

source: Change the font size
fr_fr: Changer la taille de police

source: Modify the font size of a Text Box object.
fr_fr: Modifie la taille de police d'un objet zone de texte.

source: Do _PARAM1__PARAM2_ to the font size of _PARAM0_
fr_fr: Faire _PARAM1__PARAM2_ à la taille de police de _PARAM0_

source: Value
fr_fr: Valeur

source: Test the font size
fr_fr: Tester la taille de police

source: Test the font size of a Text Box object.
fr_fr: Teste la taille de police d'un objet zone de texte.

source: The font size of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: Le taille de police de _PARAM0_ est _PARAM1__PARAM2_

source: Size to test
fr_fr: Taille à tester

source: Change the angle
fr_fr: Changer l'angle

source: Modify the angle of a Text Box object.
fr_fr: Modifier l'angle d'un objet zone de texte.

source: Do _PARAM1__PARAM2_ to the angle of _PARAM0_
fr_fr: Faire _PARAM1__PARAM2_ à l'angle de _PARAM0_

source: Test the angle
fr_fr: Tester l'angle

source: Test the value of the angle of a Text Box object.
fr_fr: Teste la valeur de l'angle d'un objet zone de texte.

source: The angle of _PARAM0_ is _PARAM1__PARAM2_
fr_fr: L'angle de _PARAM0_ est _PARAM1__PARAM2_

source: Value to test
fr_fr: Valeur à tester

source: String
fr_fr: Texte

source: Character size
fr_fr: Taille de police

source: Edit the TextBox object
fr_fr: Editer l'objet Zone de Texte

source: Allow text selection
fr_fr: Autoriser la sélection de texte

source: Hide character :
fr_fr: Caractère masquant :

source: The hide character is a character that hide real characters to be shown in the text box (for a password for example).
fr_fr: The caractère masquant est un caractère qui masque le vrai contenu de la zone de texte. (pour masquer un mot de passe par exemple).

source: Placeholder :
fr_fr: Texte d'indication :

source: The placeholder is a text shown when the text box is empty and doesn't have the focus to give an indication.
fr_fr: Le texte d'indication est un texte affiché quand la zone de texte est vide et n'a pas le focus (état normal) pour donner une indication.

source: Others properties
fr_fr: Autres propriétés

source: Edit the color palette
fr_fr: Editer la palette de couleur

source: Border thickness :
fr_fr: Epaisseur de la bordure :

source: Font :
fr_fr: Police :

source: Choose the font
fr_fr: Choisir la police

source: Size :
fr_fr: Taille de la police :

source: Cancel
fr_fr: Annuler

source: Background
fr_fr: Arrière-plan

source: Border
fr_fr: Bordure

source: Selection
fr_fr: Sélection

source: Choose a font ( ttf/ttc files )
fr_fr: Choisissez une police (fichiers ttf/ttc)

source: Edit the palette
fr_fr: Editer la palette de couleur

source: Disabled
fr_fr: Désactivé

source: Enabled
fr_fr: Activé

source: Hovered
fr_fr: Survolé

source: Focused
fr_fr: Avec le focus

source: Focused and hovered
fr_fr: Avec le focus et survolé

source: Color
fr_fr: Couleur
